dictionary = {
    "Гаррі Поттер і філософський камінь": {
        "Автор": "Дж. К. Ролінг",
        "Рік видання": 1997,
        "Кількість сторінок": 223
    },
    "Сто років самотності": {
        "Автор": "Габріель Гарсіа Маркес",
        "Рік видання": 1967,
        "Кількість сторінок": 417
    },
    "Над прірвою в житі": {
        "Автор": "Джером Селінджер",
        "Рік видання": 1951,
        "Кількість сторінок": 277
    },
    "Маленький принц": {
        "Автор": "Антуан де Сент-Екзюпері",
        "Рік видання": 1943,
        "Кількість сторінок": 96
    },
    "1984": {
        "Автор": "Джордж Орвелл",
        "Рік видання": 1949,
        "Кількість сторінок": 328
    }

}

book_name = input("Введіть назву книги: ")

if book_name in dictionary:
    book_info = dictionary[book_name]
    print(f"Інформація про книгу '{book_name}':")
    print(f"Автор: {book_info['Автор']}")
    print(f"Рік видання: {book_info['Рік видання']}")
    print(f"Кількість сторінок: {book_info['Кількість сторінок']}")
else:
    print("Такої книги немає в бібліотеці.")
